print ("โปรแกรมคำนวณการทาสี")
w = float(input("ใส่ขนาดความกว้างของบ้าน(เมตร) : "))
l = float(input("ใส่ขนาดความยาวของบ้าน(เมตร) : "))
h = float(input("ใส่ขนาดความสูงของบ้าน(เมตร) : "))
o = w * l * h
print()
print ("จำนวนพื้นที่บ้านภายนอกในการทาสีทั้งหมด : " ,("%4.2f" % o) , "ตารางเมตร")
col = o / 2.5
print ("จำนวนสีที่ใช้ในการทาสีทั้งหมด : " , ("%4.2f" % col) , "ลิตร")
c = o / 10
print ("จำนวนสีที่ใช้ในการทาสีทั้งหมด : " , int(c) , "กระป๋อง")
print ("จำนวนสีที่ใช้ในการทาสีทั้งหมด : " , ("%4.2f" % (c * 200)) , "บาท")
