E = int(input("ใส่ค่าแรงดันไฟฟ้าของแหล่งจ่ายไฟฟ้า(โวลต์) : "))
R1 = int(input("ใส่ค่าความต้านทานตัวที่ 1 (โอมห์) : "))
R2 = int(input("ใส่ค่าความต้านทานตัวที่ 2 (โอมห์) : "))
R3 = int(input("ใส่ค่าความต้านทานตัวที่ 3 (โอมห์) : "))
R = R1 + R2 + R3
I = E / R
I1 = I * R1
I2 = I * R2
I3 = I * R3
print ("ค่ากระแสไฟฟ้าของวงจร : " , I , "แอมป์" )
print ("ค่าแรงดันไฟฟ้าตกคร่อมความต้านทานตัวที่ 1 : " , ("%4.2f" % I1) , "โวลต์")
print ("ค่าแรงดันไฟฟ้าตกคร่อมความต้านทานตัวที่ 2 : " , ("%4.2f" % I2) , "โวลต์")
print ("ค่าแรงดันไฟฟ้าตกคร่อมความต้านทานตัวที่ 3 : " , ("%4.2f" % I3) , "โวลต์")



